---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialColor.Dispose
source: html/ec0c291d-91de-7fa7-770a-16e0d8bc938f.htm
---
# Autodesk.Revit.DB.Lighting.InitialColor.Dispose Method

Releases all resources used by the InitialColor

## Syntax (C#)
```csharp
public void Dispose()
```